levizh/hc32m423/ddl/hc32m423_ddl/driver/src/hc32m423_timerb.c
#define IS_TIMERB_CMP_EVT_STATE(x)                                             \
(   (TIMERB_CMP_EVT_ENABLE == (x))              ||                             \
    (TIMERB_CMP_EVT_DISABLE == (x)))

#define IS_TIMERB_IC_NOISE_FILTER_CLKDIV(x)                                    \
(   (TIMERB_IC_NOFICLKDIV_NONE == (x))          ||                             \
    (TIMERB_IC_NOFICLKDIV_DIV1 == (x))          ||                             \
    (TIMERB_IC_NOFICLKDIV_DIV4 == (x))          ||                             \
    (TIMERB_IC_NOFICLKDIV_DIV16 == (x))         ||                             \
    (TIMERB_IC_NOFICLKDIV_DIV64 == (x)))

#define IS_TIMERB_OC_START_CNT_OUTPUT_POLARITY(x)                              \
(   (TIMERB_OC_STARTCNT_OUTPUT_LOW == (x))      ||                             \
    (TIMERB_OC_STARTCNT_OUTPUT_HIGH == (x))     ||                             \
    (TIMERB_OC_STARTCNT_OUTPUT_HOLD == (x)))

#define IS_TIMERB_OC_STOP_CNT_OUTPUT_POLARITY(x)                               \
(   (TIMERB_OC_STOPCNT_OUTPUT_LOW == (x))       ||                             \
    (TIMERB_OC_STOPCNT_OUTPUT_HIGH == (x))      ||                             \
    (TIMERB_OC_STOPCNT_OUTPUT_HOLD == (x)))

#define IS_TIMERB_OC_CMPMATCH_OUTPUT_POLARITY(x)                               \
(   (TIMERB_OC_CMPMATCH_OUTPUT_LOW == (x))      ||                             \
    (TIMERB_OC_CMPMATCH_OUTPUT_HIGH == (x))     ||                             \
    (TIMERB_OC_CMPMATCH_OUTPUT_HOLD == (x))     ||                             \
    (TIMERB_OC_CMPMATCH_OUTPUT_INVERTED == (x)))

#define IS_TIMERB_OC_PERIODMATCH_OUTPUT_POLARITY(x)                            \
(   (TIMERB_OC_PERIODMATCH_OUTPUT_LOW == (x))   ||                             \
    (TIMERB_OC_PERIODMATCH_OUTPUT_HIGH == (x))  ||                             \
    (TIMERB_OC_PERIODMATCH_OUTPUT_HOLD == (x))  ||                             \
    (TIMERB_OC_PERIODMATCH_OUTPUT_INVERTED == (x)))

#define IS_TIMERB_OC_FORCE_OUTPUT_POLARITY(x)                                  \
(   (TIMERB_OC_FORCE_OUTPUT_LOW == (x))         ||                             \
    (TIMERB_OC_FORCE_OUTPUT_HIGH == (x))        ||                             \
    (TIMERB_OC_FORCE_OUTPUT_INVALID == (x)))

#define IS_TIMERB_OC_PORT_OUTPUT_STATE(x)                                      \
(   (TIMERB_OC_PORT_OUTPUT_ENABLE == (x))       ||                             \
    (TIMERB_OC_PORT_OUTPUT_DISABLE == (x)))

#define IS_TIMERB_IC_CAPTURE_CONDITION(x)   ((!((x) & ((uint16_t)(~TMRB_CCONR_HICP)))) || ((x) == TIMERB_IC_INVALID))

#define IS_TIMERB_IC_HSTART_CONDITION(x)    ((!((x) & ((uint16_t)(~TMRB_HCONR_HSTA)))) || ((x) == TIMERB_HWSTART_INVALID))

#define IS_TIMERB_IC_HSTOP_CONDITION(x)     ((!((x) & ((uint16_t)(~TMRB_HCONR_HSTP)))) || ((x) == TIMERB_HWSTOP_INVALID))

#define IS_TIMERB_IC_HCLEAR_CONDITION(x)    ((!((x) & ((uint16_t)(~TMRB_HCONR_HCLE)))) || ((x) == TIMERB_HWCLEAR_INVALID))

#define IS_TIMERB_IC_HCUP_CONDITION(x)      ((!((x) & ((uint16_t)(~TMRB_HCUPR_HCUP)))) || ((x) == TIMERB_HWUP_INVALID))

#define IS_TIMERB_IC_HCDOWN_CONDITION(x)    ((!((x) & ((uint16_t)(~TMRB_HCDOR_HCDO)))) || ((x) == TIMERB_HWDOWN_INVALID))
/**
 * @}
 */

/**
 * @defgroup TIMERB_Function_Mode TimerB Function Mode
 * @{
 */
#define TIMERB_INPUT_CAPTURE                    (TMRB_CCONR_CAPMDA)     /*!< Capture input function */
#define TIMERB_OUTPUT_COMPARE                   ((uint16_t)0x0000U)     /*!< Comare output function */
/**
 * @}
 */

/**
 * @defgroup TIMERB_PWM_Channel TIMERB PWM Channel
 * @{
 */
#define TIMERB_PWM_CH1                          (TIMERB_CH1)
#define TIMERB_PWM_CH2                          (TIMERB_CH2)
#define TIMERB_PWM_CH3                          (TIMERB_CH3)
#define TIMERB_PWM_CH4                          (TIMERB_CH4)
/**
 * @}
 */

/**
 * @defgroup TIMERB_BCONRx_Register TIMERB BCONRx Register(x = 1 ~ 3)
 * @brief Get the specified BCONR register address of the specified TIMERB unit
 * @{
 */
#define TMRB_BCONRx(__TMRBx__, __CH__)       ((__IO uint16_t *)((uint32_t)(&((__TMRBx__)->BCONR1)) + ((uint32_t)(__CH__))*4UL))
/**
 * @}
 */

/**
 * @defgroup TIMERB_CMPARx_Register TIMERB CMPARx Register(x = 1 ~ 6)
 * @brief Get the specified CMPAR register address of the specified TIMERB unit
 * @{
 */
#define TMRB_CMPARx(__TMRBx__, __CH__)       ((__IO uint16_t *)((uint32_t)(&((__TMRBx__)->CMPAR1)) + ((uint32_t)(__CH__))*4UL))
/**
 * @}
 */

/**
 * @defgroup TIMERB_CCONRx_Register TIMERB CCONRx Register(x = 1 ~ 4)
 * @brief Get the specified CCONR register address of the specified TIMERB unit
 * @{
 */
#define TMRB_CCONRx(__TMRBx__, __CH__)       ((__IO uint16_t *)((uint32_t)(&((__TMRBx__)->CCONR1)) + ((uint32_t)(__CH__))*4UL))
/**
 * @}
 */

/**
 * @defgroup TIMERB_PCONRx_Register TIMERB PCONRx Register(x = 1 ~ 4)
 * @brief Get the specified PCONR register address of the specified TIMERB unit
 * @{
 */
#define TMRB_PCONRx(__TMRBx__, __CH__)       ((__IO uint16_t *)((uint32_t)(&((__TMRBx__)->PCONR1)) + ((uint32_t)(__CH__))*4UL))
/**
 * @}
 */

/**
 * @}
 */

/*******************************************************************************
 * Global variable definitions (declared in header file with 'extern')
 ******************************************************************************/

/*******************************************************************************
 * Local function prototypes ('static')
 ******************************************************************************/

/*******************************************************************************
 * Local variable definitions ('static')
 ******************************************************************************/

/*******************************************************************************
 * Function implementation - global ('extern') and local ('static')
 ******************************************************************************/
/** 
 * @defgroup TIMERB_Global_Functions TimerB Global Functions
 * @{
 */

/**
 * @brief  Initialize TimerB base function.
 * @param  [in] TMRBx                   Pointer to TimerB instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_TMRB:              TimerB unit 1 instance register base
 * @param  [in] pstcInit                Pointer to a @ref stc_timerb_init_t structure (TMRBx unit base function configuration data structure).
 * @retval An en_result_t enumeration value:
 *           - Ok: Initialize success
 *           - ErrorInvalidParameter: TMRBx is invalid instance or pstcInit = NULL
 */
en_result_t TIMERB_Init(M4_TMRB_TypeDef *TMRBx,
                            const stc_timerb_init_t *pstcInit)
{
    en_result_t enRet = ErrorInvalidParameter;

    /* Check TMRBx instance and pstcInit */
    if ((IS_TIMERB_INSTANCE(TMRBx)) && (NULL != pstcInit))
    {
        /* Check parameters */
        DDL_ASSERT(0U != pstcInit->u16PeriodVal);
        DDL_ASSERT(IS_TIMERB_CNT_MODE(pstcInit->u16CntMode));
        DDL_ASSERT(IS_TIMERB_CLOCK_DIV(pstcInit->u16ClkDiv));
        DDL_ASSERT(IS_TIMERB_CNT_DIRECTION(pstcInit->u16CntDir));
        DDL_ASSERT(IS_TIMERB_OVERFLOW_STATE(pstcInit->u16OverflowAction));

