levizh/hc32m423/ddl/hc32m423_ddl/driver/src/hc32m423_timerb.c
        WRITE_REG16(TMRBx->CNTER, 0U);
        WRITE_REG16(TMRBx->PERAR, pstcInit->u16PeriodVal);
        MODIFY_REG16(TMRBx->BCSTR,                                             \
                     (TMRB_BCSTR_DIR   | TMRB_BCSTR_MODE |                     \
                      TMRB_BCSTR_CKDIV | TMRB_BCSTR_OVSTP),                    \
                     (pstcInit->u16CntDir | pstcInit->u16CntMode |             \
                      pstcInit->u16ClkDiv | pstcInit->u16OverflowAction));

        /* Set hardware trigger event */
        WRITE_REG16(TMRBx->HCONR,                                              \
                    (pstcInit->u16HwStartCondition |                           \
                     pstcInit->u16HwStopCondition  |                           \
                     pstcInit->u16HwClearCondition));
        WRITE_REG16(TMRBx->HCUPR, pstcInit->u16HwUpCondition);
        WRITE_REG16(TMRBx->HCDOR, pstcInit->u16HwDownCondition);
        enRet = Ok;
    }

    return enRet;
}

/**
 * @brief  Set the fields of structure stc_timerb_init_t to default values.
 * @param  [out] pstcInit               Pointer to a @ref stc_timerb_init_t structure (TMRBx unit base function configuration data structure).
 * @retval An en_result_t enumeration value:
 *           - Ok: Initialize success
 *           - ErrorInvalidParameter: pstcInit = NULL
 */
en_result_t TIMERB_StructInit(stc_timerb_init_t *pstcInit)
{
    en_result_t enRet = ErrorInvalidParameter;

    /* Check parameters */
    if (NULL != pstcInit)
    {
        pstcInit->u16PeriodVal = 0xFFFFu;
        pstcInit->u16CntDir = TIMERB_CNT_UP;
        pstcInit->u16CntMode = TIMERB_SAWTOOTH_WAVE;
        pstcInit->u16ClkDiv = TIMERB_CLKDIV_DIV1;
        pstcInit->u16OverflowAction = TIMERB_OVERFLOW_COUNT;
        pstcInit->u16HwStartCondition = TIMERB_HWSTART_INVALID;
        pstcInit->u16HwStopCondition = TIMERB_HWSTOP_INVALID;
        pstcInit->u16HwClearCondition = TIMERB_HWCLEAR_INVALID;
        pstcInit->u16HwUpCondition = TIMERB_HWUP_INVALID;
        pstcInit->u16HwDownCondition = TIMERB_HWDOWN_INVALID;
        enRet = Ok;
    }

    return enRet;
}

/**
 * @brief  De-Initialize TimerB unit base function.
 * @param  [in] TMRBx                   Pointer to TimerB instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_TMRB:              TimerB unit 1 instance register base
 * @retval An en_result_t enumeration value:
 *           - Ok: De-Initialize success
 *           - ErrorInvalidParameter: TMRBx is invalid instance
 */
en_result_t TIMERB_DeInit(M4_TMRB_TypeDef *TMRBx)
{
    en_result_t enRet = ErrorInvalidParameter;

    /* Check TMRBx instance */
    if (IS_TIMERB_INSTANCE(TMRBx))
    {
        /* Configures the registers to reset value. */
        WRITE_REG16(TMRBx->CNTER, 0x0000U);
        WRITE_REG16(TMRBx->PERAR, 0xFFFFu);
        WRITE_REG16(TMRBx->BCSTR, 0x0002U);
        enRet = Ok;
    }

    return enRet;
}

/**
 * @brief  Set TimerB count direction.
 * @param  [in] TMRBx                   Pointer to TimerB instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_TMRB:              TimerB unit 1 instance register base
 * @param  [in] u16Direction            TimerB count direction
 *         This parameter can be one of the following values:
 *           @arg TIMERB_CNT_UP:        TimerB count up
 *           @arg TIMERB_CNT_DOWN:      TimerB count down
 * @retval None
 */
void TIMERB_SetCntDirection(M4_TMRB_TypeDef *TMRBx, uint16_t u16Direction)
{
    /* Check parameters */
    DDL_ASSERT(IS_TIMERB_INSTANCE(TMRBx));
    DDL_ASSERT(IS_TIMERB_CNT_DIRECTION(u16Direction));

    MODIFY_REG16(TMRBx->BCSTR, TMRB_BCSTR_DIR, u16Direction);
}

/**
 * @brief  Get TimerB count direction.
 * @param  [in] TMRBx                   Pointer to TimerB instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_TMRB:              TimerB unit 1 instance register base
 * @retval Returned value can be one of the following values:
 *           @arg TIMERB_CNT_UP:        TimerB count up
 *           @arg TIMERB_CNT_DOWN:      TimerB count down
 */
uint16_t TIMERB_GetCntDirection(M4_TMRB_TypeDef *TMRBx)
{
    /* Check parameters */
    DDL_ASSERT(IS_TIMERB_INSTANCE(TMRBx));

    return READ_REG16_BIT(TMRBx->BCSTR, TMRB_BCSTR_DIR);
}

/**
 * @brief  Set TimerB count mode.
 * @param  [in] TMRBx                   Pointer to TimerB instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_TMRB:              TimerB unit 1 instance register base
 * @param  [in] u16Mode                 TimerB count mode
 *         This parameter can be one of the following values:
 *           @arg TIMERB_TRIANGLE_WAVE: TimerB triangle wave mode
 *           @arg TIMERB_SAWTOOTH_WAVE: TimerB sawtooth wave mode
 * @retval None
 */
void TIMERB_SetCntMode(M4_TMRB_TypeDef *TMRBx, uint16_t u16Mode)
{
    /* Check parameters */
    DDL_ASSERT(IS_TIMERB_INSTANCE(TMRBx));
    DDL_ASSERT(IS_TIMERB_CNT_MODE(u16Mode));

    MODIFY_REG16(TMRBx->BCSTR, TMRB_BCSTR_MODE, u16Mode);
}

/**
 * @brief  Get TimerB count mode.
 * @param  [in] TMRBx                   Pointer to TimerB instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_TMRB:              TimerB unit 1 instance register base
 * @retval Returned value can be one of the following values:
 *           @arg TIMERB_TRIANGLE_WAVE: TimerB triangle wave mode
 *           @arg TIMERB_SAWTOOTH_WAVE: TimerB sawtooth wave mode
 */
uint16_t TIMERB_GetCntMode(M4_TMRB_TypeDef *TMRBx)
{
    /* Check parameters */
    DDL_ASSERT(IS_TIMERB_INSTANCE(TMRBx));

    return READ_REG16_BIT(TMRBx->BCSTR, TMRB_BCSTR_MODE);
}

/**
 * @brief  Set TimerB clock division.
 * @param  [in] TMRBx                   Pointer to TimerB instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_TMRB:              TimerB unit 1 instance register base
 * @param  [in] u16Div                  TimerB clock division
 *         This parameter can be one of the following values:
 *           @arg TIMERB_CLKDIV_DIV1:   HCLK
 *           @arg TIMERB_CLKDIV_DIV2:   HCLK/2
 *           @arg TIMERB_CLKDIV_DIV4:   HCLK/4
 *           @arg TIMERB_CLKDIV_DIV8:   HCLK/8
 *           @arg TIMERB_CLKDIV_DIV16:  HCLK/16
 *           @arg TIMERB_CLKDIV_DIV32:  HCLK/32
 *           @arg TIMERB_CLKDIV_DIV64:  HCLK/64
 *           @arg TIMERB_CLKDIV_DIV128: HCLK/128
 *           @arg TIMERB_CLKDIV_DIV256: HCLK/256
 *           @arg TIMERB_CLKDIV_DIV512: HCLK/512
 *           @arg TIMERB_CLKDIV_DIV1024:HCLK/1024
 * @retval None
 */
void TIMERB_SetClkDiv(M4_TMRB_TypeDef *TMRBx, uint16_t u16Div)
{
    /* Check parameters */
    DDL_ASSERT(IS_TIMERB_INSTANCE(TMRBx));
    DDL_ASSERT(IS_TIMERB_CLOCK_DIV(u16Div));

    MODIFY_REG16(TMRBx->BCSTR, TMRB_BCSTR_CKDIV, u16Div);
}

/**
 * @brief  Get TimerB clock division.
 * @param  [in] TMRBx                   Pointer to TimerB instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_TMRB:              TimerB unit 1 instance register base
 * @retval Returned value can be one of the following values:
 *           @arg TIMERB_CLKDIV_DIV1:   HCLK
 *           @arg TIMERB_CLKDIV_DIV2:   HCLK/2
 *           @arg TIMERB_CLKDIV_DIV4:   HCLK/4
 *           @arg TIMERB_CLKDIV_DIV8:   HCLK/8
 *           @arg TIMERB_CLKDIV_DIV16:  HCLK/16
 *           @arg TIMERB_CLKDIV_DIV32:  HCLK/32
 *           @arg TIMERB_CLKDIV_DIV64:  HCLK/64
 *           @arg TIMERB_CLKDIV_DIV128: HCLK/128
 *           @arg TIMERB_CLKDIV_DIV256: HCLK/256
 *           @arg TIMERB_CLKDIV_DIV512: HCLK/512
 *           @arg TIMERB_CLKDIV_DIV1024:HCLK/1024
 */
uint16_t TIMERB_GetClkDiv(M4_TMRB_TypeDef *TMRBx)
{
    /* Check parameters */
    DDL_ASSERT(IS_TIMERB_INSTANCE(TMRBx));

    return READ_REG16_BIT(TMRBx->BCSTR, TMRB_BCSTR_CKDIV);
}

/**
 * @brief  Get TimerB flag status.
 * @param  [in] TMRBx                   Pointer to TimerB instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_TMRB:              TimerB unit 1 instance register base
 * @param  [in] u16Flag                 TimerB flag type
 *         This parameter can be one of the following values:
 *           @arg TIMERB_FLAG_OVF:      Overflow flag
 *           @arg TIMERB_FLAG_UDF:      Underflow flag
 *           @arg TIMERB_FLAG_CMP:      Compare match flag
 * @retval An en_flag_status_t enumeration value:
 *           - Set: Flag is set
 *           - Reset: Flag is reset
 */
en_flag_status_t TIMERB_GetFlag(M4_TMRB_TypeDef *TMRBx, uint16_t u16Flag)
{
    en_flag_status_t enFlag = Reset;

    /* Check parameters */
    DDL_ASSERT(IS_TIMERB_INSTANCE(TMRBx));
    DDL_ASSERT(IS_TIMERB_FLAG(u16Flag));

    switch (u16Flag)
    {
        case TIMERB_FLAG_OVF:
        case TIMERB_FLAG_UDF:
            enFlag = (READ_REG16_BIT(TMRBx->BCSTR, u16Flag)) ? Set : Reset;
            break;
        case TIMERB_FLAG_CMP1:
        case TIMERB_FLAG_CMP2:
        case TIMERB_FLAG_CMP3:
        case TIMERB_FLAG_CMP4:
        case TIMERB_FLAG_CMP5:
        case TIMERB_FLAG_CMP6:
            enFlag = (READ_REG16_BIT(TMRBx->STFLR, u16Flag)) ? Set : Reset;
            break;
        default:
            break;
    }

