levizh/hc32m423/ddl/hc32m423_ddl/driver/src/hc32m423_timerb.c
    return enFlag;
}

/**
 * @brief  Clear TimerB flag.
 * @param  [in] TMRBx                   Pointer to TimerB instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_TMRB:              TimerB unit 1 instance register base
 * @param  [in] u16Flag                 TimerB flag type
 *         This parameter can be one of the following values:
 *           @arg TIMERB_FLAG_OVF:      Overflow flag
 *           @arg TIMERB_FLAG_UDF:      Underflow flag
 *           @arg TIMERB_FLAG_CMP:      Compare match flag
 * @retval None
 */
void TIMERB_ClearFlag(M4_TMRB_TypeDef *TMRBx, uint16_t u16Flag)
{
    /* Check parameters */
    DDL_ASSERT(IS_TIMERB_INSTANCE(TMRBx));
    DDL_ASSERT(IS_TIMERB_FLAG(u16Flag));

    switch (u16Flag)
    {
        case TIMERB_FLAG_OVF:
        case TIMERB_FLAG_UDF:
            CLEAR_REG16_BIT(TMRBx->BCSTR, u16Flag);
            break;
        case TIMERB_FLAG_CMP1:
        case TIMERB_FLAG_CMP2:
        case TIMERB_FLAG_CMP3:
        case TIMERB_FLAG_CMP4:
        case TIMERB_FLAG_CMP5:
        case TIMERB_FLAG_CMP6:
            CLEAR_REG16_BIT(TMRBx->STFLR, u16Flag);
            break;
        default:
            break;
    }
}

/**
 * @brief  Enable or disable specified TimerB interrupt.
 * @param  [in] TMRBx                   Pointer to TimerB instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_TMRB:              TimerB unit 1 instance register base
 * @param  [in] u16IntSource            TimerB interrupt source
 *         This parameter can be one of the following values:
 *           @arg TIMERB_INT_OVF:       Overflow interrupt
 *           @arg TIMERB_INT_UDF:       Underflow interrupt
 *           @arg TIMERB_INT_CMP1:      Channel 1 compare match interrupt
 *           @arg TIMERB_INT_CMP2:      Channel 2 compare match interrupt
 *           @arg TIMERB_INT_CMP3:      Channel 3 compare match interrupt
 *           @arg TIMERB_INT_CMP4:      Channel 4 compare match interrupt
 *           @arg TIMERB_INT_CMP5:      Channel 5 compare match interrupt
 *           @arg TIMERB_INT_CMP6:      Channel 6 compare match interrupt
 * @param  [in] enNewSta                The function new state.
 *           @arg  This parameter can be: Enable or Disable.
 * @retval None
 */
void TIMERB_IntCmd(M4_TMRB_TypeDef *TMRBx,
                        uint16_t u16IntSource,
                        en_functional_state_t enNewSta)
{
    /* Check parameters */
    DDL_ASSERT(IS_TIMERB_INSTANCE(TMRBx));
    DDL_ASSERT(IS_TIMERB_INT(u16IntSource));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewSta));

    switch (u16IntSource)
    {
        case TIMERB_IT_OVF:
        case TIMERB_IT_UDF:
            if (Enable == enNewSta)
            {
                SET_REG16_BIT(TMRBx->BCSTR, u16IntSource);
            }
            else
            {
                CLEAR_REG16_BIT(TMRBx->BCSTR, u16IntSource);
            }
            break;
        case TIMERB_IT_CMP1:
        case TIMERB_IT_CMP2:
        case TIMERB_IT_CMP3:
        case TIMERB_IT_CMP4:
        case TIMERB_IT_CMP5:
        case TIMERB_IT_CMP6:
            if (Enable == enNewSta)
            {
                SET_REG16_BIT(TMRBx->ICONR, u16IntSource);
            }
            else
            {
                CLEAR_REG16_BIT(TMRBx->ICONR, u16IntSource);
            }
            break;
        default:
            break;
    }
}

/**
 * @brief  Set TimerB hardware trigger counter condition.
 * @param  [in] TMRBx                   Pointer to TimerB instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_TMRB:              TimerB unit 1 instance register base
 * @param  [in] u16Condition            TimerB hardware start counter condition
 *         This parameter can be any composed value of the following values:
 *           @arg @ref TIMERB_Hardware_Start_Count_Condition
 *           @arg @ref TIMERB_Hardware_Stop_Count_Condition
 *           @arg @ref TIMERB_Hardware_Clear_Count_Condition
 * @retval  None
 */
void TIMERB_SetHwTriggerCondition(M4_TMRB_TypeDef *TMRBx,
                                        uint16_t u16Condition)
{
    /* Check parameters */
    DDL_ASSERT(IS_TIMERB_INSTANCE(TMRBx));

    WRITE_REG16(TMRBx->HCONR, u16Condition);
}

/**
 * @brief  Set TimerB hardware start counter condition.
 * @param  [in] TMRBx                   Pointer to TimerB instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_TMRB:              TimerB unit 1 instance register base
 * @param  [in] u16Condition            TimerB hardware start counter condition
 *         This parameter can be any composed value of the following values:
 *           @arg TIMERB_HWSTART_INVALID:               Hardware start is invalid
 *           @arg TIMERB_HWSTART_TIMB_T_PWM1_RISING:    Hardware start counter by rising edge on timer input TIMB_<t>_PWM1 (t = 1~8) when sysnc start function is invalid or
 *                                                      hardware start counter by rising edge on timer input TIMB_n_PWM1 (n = 1,3,5,7) when sysnc start function is invalid
 *           @arg TIMERB_HWSTART_TIMB_T_PWM1_FALLING:   Hardware start counter by falling edge on timer input TIMB_<t>_PWM1 (t = 1~8) when sysnc start function is invalid or
 *                                                      hardware start counter by falling edge on timer input TIMB_n_PWM1 (n = 1,3,5,7) when sysnc start function is invalid
 *           @arg TIMERB_HWSTART_TIMB_EVT:              Hardware start counter by the timer TMRB_HTSSR specified event
 * @retval  None
 */
void TIMERB_SetHwStartCondition(M4_TMRB_TypeDef *TMRBx,
                                        uint16_t u16Condition)
{
    /* Check parameters */
    DDL_ASSERT(IS_TIMERB_INSTANCE(TMRBx));
    DDL_ASSERT(IS_TIMERB_IC_HSTART_CONDITION(u16Condition));

    MODIFY_REG16(TMRBx->HCONR, TMRB_HCONR_HSTA, u16Condition);
}

/**
 * @brief  Get TimerB hardware start counter condition.
 * @param  [in] TMRBx                   Pointer to TimerB instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_TMRB:              TimerB unit 1 instance register base
 * @retval Returned value can be any composed value of the following values:
 *           @arg TIMERB_HWSTART_INVALID:               Hardware start is invalid
 *           @arg TIMERB_HWSTART_TIMB_T_PWM1_RISING:    Hardware start counter by rising edge on timer input TIMB_<t>_PWM1 (t = 1~8) when sysnc start function is invalid or
 *                                                      hardware start counter by rising edge on timer input TIMB_n_PWM1 (n = 1,3,5,7) when sysnc start function is invalid
 *           @arg TIMERB_HWSTART_TIMB_T_PWM1_FALLING:   Hardware start counter by falling edge on timer input TIMB_<t>_PWM1 (t = 1~8) when sysnc start function is invalid or
 *                                                      hardware start counter by falling edge on timer input TIMB_n_PWM1 (n = 1,3,5,7) when sysnc start function is invalid
 *           @arg TIMERB_HWSTART_TIMB_EVT:              Hardware start counter by the timer TMRB_HTSSR specified event
 */
uint16_t TIMERB_GetHwStartCondition(M4_TMRB_TypeDef *TMRBx)
{
    /* Check parameters */
    DDL_ASSERT(IS_TIMERB_INSTANCE(TMRBx));

    return READ_REG16_BIT(TMRBx->HCONR, TMRB_HCONR_HSTA);
}

/**
 * @brief  Set TimerB hardware stop counter condition.
 * @param  [in] TMRBx                   Pointer to TimerB instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_TMRB:              TimerB unit 1 instance register base
 * @param  [in] u16Condition            TimerB hardware stop counter condition
 *         This parameter can be any composed value of the following values:
 *           @arg TIMERB_HWSTOP_INVALID:                Hardware stop is invalid
 *           @arg TIMERB_HWSTOP_TIMB_T_PWM1_RISING:     Hardware stop counter by rising edge on timer input TIMB_<t>_PWM1 (t = 1~8)
 *           @arg TIMERB_HWSTOP_TIMB_T_PWM1_FALLING:    Hardware stop counter by falling edge on timer input TIMB_<t>_PWM1 (t = 1~8)
 *           @arg TIMERB_HWSTOP_TIMB_EVT:               Hardware stop counter by the timer TMRB_HTSSR specified event
 * @retval  None
 */
void TIMERB_SetHwStopCondition(M4_TMRB_TypeDef *TMRBx,
                                        uint16_t u16Condition)
{
    /* Check parameters */
    DDL_ASSERT(IS_TIMERB_INSTANCE(TMRBx));
    DDL_ASSERT(IS_TIMERB_IC_HSTOP_CONDITION(u16Condition));

    MODIFY_REG16(TMRBx->HCONR, TMRB_HCONR_HSTP, u16Condition);
}

/**
 * @brief  Get TimerB hardware stop counter condition.
 * @param  [in] TMRBx                   Pointer to TimerB instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_TMRB:              TimerB unit 1 instance register base
 * @retval Returned value can be any composed value of the following values:
 *           @arg TIMERB_HWSTOP_INVALID:                Hardware stop is invalid
 *           @arg TIMERB_HWSTOP_TIMB_T_PWM1_RISING:     Hardware stop counter by rising edge on timer input TIMB_<t>_PWM1 (t = 1~8)
 *           @arg TIMERB_HWSTOP_TIMB_T_PWM1_FALLING:    Hardware stop counter by falling edge on timer input TIMB_<t>_PWM1 (t = 1~8)
 *           @arg TIMERB_HWSTOP_TIMB_EVT:               Hardware stop counter by the timer TMRB_HTSSR specified event
 */
uint16_t TIMERB_GetHwStopCondition(M4_TMRB_TypeDef *TMRBx)
{
    /* Check parameters */
    DDL_ASSERT(IS_TIMERB_INSTANCE(TMRBx));

