levizh/hc32m423/ddl/hc32m423_ddl/driver/src/hc32m423_timerb.c
    return READ_REG16_BIT(TMRBx->HCONR, TMRB_HCONR_HSTP);
}

/**
 * @brief  Set TimerB hardware clear counter condition.
 * @param  [in] TMRBx                   Pointer to TimerB instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_TMRB:              TimerB unit 1 instance register base
 * @param  [in] u16Condition            TimerB hardware clear counter condition
 *         This parameter can be any composed value of the following values:
 *           @arg TIMERB_HWCLEAR_INVALID:               Hardware clear is invalid
 *           @arg TIMERB_HWCLEAR_TIMB_T_PWM1_RISING:    Hardware clear counter by rising edge on timer input TIMB_<t>_PWM1 (t = 1~8)
 *           @arg TIMERB_HWCLEAR_TIMB_T_PWM1_FALLING:   Hardware clear counter by falling edge on timer input TIMB_<t>_PWM1 (t = 1~8)
 *           @arg TIMERB_HWCLEAR_EVT:                   Hardware clear counter by the timer TMRB_HTSSR specified event
 *           @arg TIMERB_HWCLEAR_TIMB_N_PWM1_RISING:    Hardware clear counter by falling edge on timer input TIMB_<t>_PWM1 (t = 1~8)
 *           @arg TIMERB_HWCLEAR_TIMB_N_PWM1_FALLING:   Hardware clear counter by the timer TMRB_HTSSR specified event
 * @retval  None
 */
void TIMERB_SetHwClearCondition(M4_TMRB_TypeDef *TMRBx,
                                        uint16_t u16Condition)
{
    /* Check parameters */
    DDL_ASSERT(IS_TIMERB_INSTANCE(TMRBx));
    DDL_ASSERT(IS_TIMERB_IC_HCLEAR_CONDITION(u16Condition));

    MODIFY_REG16(TMRBx->HCONR, TMRB_HCONR_HCLE, u16Condition);
}

/**
 * @brief  Get TimerB hardware clear counter condition.
 * @param  [in] TMRBx                   Pointer to TimerB instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_TMRB:              TimerB unit 1 instance register base
 * @retval Returned value can be any composed value of the following values:
 *           @arg TIMERB_HWCLEAR_INVALID:               Hardware clear is invalid
 *           @arg TIMERB_HWCLEAR_TIMB_T_PWM1_RISING:    Hardware clear counter by rising edge on timer input TIMB_<t>_PWM1 (t = 1~8)
 *           @arg TIMERB_HWCLEAR_TIMB_T_PWM1_FALLING:   Hardware clear counter by falling edge on timer input TIMB_<t>_PWM1 (t = 1~8)
 *           @arg TIMERB_HWCLEAR_EVT:                   Hardware clear counter by the timer TMRB_HTSSR specified event
 *           @arg TIMERB_HWCLEAR_TIMB_N_PWM1_RISING:    Hardware clear counter by falling edge on timer input TIMB_<t>_PWM1 (t = 1~8)
 *           @arg TIMERB_HWCLEAR_TIMB_N_PWM1_FALLING:   Hardware clear counter by the timer TMRB_HTSSR specified event
 */
uint16_t TIMERB_GetHwClearCondition(M4_TMRB_TypeDef *TMRBx)
{
    /* Check parameters */
    DDL_ASSERT(IS_TIMERB_INSTANCE(TMRBx));

    return READ_REG16_BIT(TMRBx->HCONR, TMRB_HCONR_HCLE);
}

/**
 * @brief  Set TimerB hardware up counter condition.
 * @param  [in] TMRBx                   Pointer to TimerB instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_TMRB:              TimerB unit 1 instance register base
 * @param  [in] u16Condition            TimerB hardware up counter condition
 *         This parameter can be any composed value of the following values:
 *           @arg TIMERB_HWUP_INVALID:              Hardware count up is invalid
 *           @arg TIMERB_HWUP_TIMB_T_PWM1_RISING:   Hardware count up by rising edge on timer input TIMB_<t>_PWM1, t = 1~8
 *           @arg TIMERB_HWUP_TIMB_T_PWM1_FALLING:  Hardware count up by falling edge on timer input TIMB_<t>_PWM1, t = 1~8
 *           @arg TIMERB_HWUP_EVT:                  Hardware count up by the timer TMRB_HTSSR specified event
 *           @arg TIMERB_HWUP_OVERFLOW:             Hardware count up by overflow by TIMB_<n>, _<n>_=2/4/6/8 when m=1/3/5/7 or n=1/3/5/7 when m=2/4/6/8
 *           @arg TIMERB_HWUP_UNDERFLOW:            Hardware count up by underflow by TIMB_<n>, _<n>_=2/4/6/8 when m=1/3/5/7 or n=1/3/5/7 when m=2/4/6/8
 * @retval  None
 */
void TIMERB_SetHwUpCondition(M4_TMRB_TypeDef *TMRBx,
                                    uint16_t u16Condition)
{
    /* Check parameters */
    DDL_ASSERT(IS_TIMERB_INSTANCE(TMRBx));
    DDL_ASSERT(IS_TIMERB_IC_HCUP_CONDITION(u16Condition));

    MODIFY_REG16(TMRBx->HCUPR, TMRB_HCUPR_HCUP, u16Condition);
}

/**
 * @brief  Get TimerB hardware up counter condition.
 * @param  [in] TMRBx                   Pointer to TimerB instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_TMRB:              TimerB unit 1 instance register base
 * @retval Returned value can be any composed value of the following values:
 *           @arg TIMERB_HWUP_INVALID:              Hardware count up is invalid
 *           @arg TIMERB_HWUP_TIMB_T_PWM1_RISING:   Hardware count up by rising edge on timer input TIMB_<t>_PWM1, t = 1~8
 *           @arg TIMERB_HWUP_TIMB_T_PWM1_FALLING:  Hardware count up by falling edge on timer input TIMB_<t>_PWM1, t = 1~8
 *           @arg TIMERB_HWUP_EVT:                  Hardware count up by the timer TMRB_HTSSR specified event
 */
uint16_t TIMERB_GetHwUpCondition(M4_TMRB_TypeDef *TMRBx)
{
    /* Check parameters */
    DDL_ASSERT(IS_TIMERB_INSTANCE(TMRBx));

    return READ_REG16_BIT(TMRBx->HCUPR, TMRB_HCUPR_HCUP);
}

/**
 * @brief  Set TimerB hardware down counter condition.
 * @param  [in] TMRBx                   Pointer to TimerB instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_TMRB:              TimerB unit 1 instance register base
 * @param  [in] u16Condition            TimerB hardware down counter condition
 *         This parameter can be any composed value of the following values:
 *           @arg TIMERB_HWDOWN_INVALID:             Hardware count down is invalid
 *           @arg TIMERB_HWDOWN_TIMB_T_PWM1_RISING:  Hardware count down by rising edge on timer input TIMB_<t>_PWM1, t = 1~8
 *           @arg TIMERB_HWDOWN_TIMB_T_PWM1_FALLING: Hardware count down by falling edge on timer input TIMB_<t>_PWM1, t = 1~8
 *           @arg TIMERB_HWDOWN_EVT:                 Hardware count down by the timer TMRB_HTSSR specified event
 * @retval  None
 */
void TIMERB_SetHwDownCondition(M4_TMRB_TypeDef *TMRBx,
                                        uint16_t u16Condition)
{
    /* Check parameters */
    DDL_ASSERT(IS_TIMERB_INSTANCE(TMRBx));
    DDL_ASSERT(IS_TIMERB_IC_HCUP_CONDITION(u16Condition));

    MODIFY_REG16(TMRBx->HCDOR, TMRB_HCDOR_HCDO, u16Condition);
}

/**
 * @brief  Get TimerB hardware down counter condition.
 * @param  [in] TMRBx                   Pointer to TimerB instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_TMRB:              TimerB unit 1 instance register base
 * @retval Returned value can be any composed value of the following values:
 *           @arg TIMERB_HWDOWN_INVALID:             Hardware count down is invalid
 *           @arg TIMERB_HWDOWN_TIMB_T_PWM1_RISING:  Hardware count down by rising edge on timer input TIMB_<t>_PWM1, t = 1~8
 *           @arg TIMERB_HWDOWN_TIMB_T_PWM1_FALLING: Hardware count down by falling edge on timer input TIMB_<t>_PWM1, t = 1~8
 *           @arg TIMERB_HWDOWN_EVT:                 Hardware count down by the timer TMRB_HTSSR specified event
 */
uint16_t TIMERB_GetHwDownCondition(M4_TMRB_TypeDef *TMRBx)
{
    /* Check parameters */
    DDL_ASSERT(IS_TIMERB_INSTANCE(TMRBx));

    return READ_REG16_BIT(TMRBx->HCDOR, TMRB_HCDOR_HCDO);
}

/**
 * @brief  Enable TimerB buffer function.
 * @param  [in] TMRBx                   Pointer to TimerB instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_TMRB:              TimerB unit 1 instance register base
 * @param  [in] u32Ch                   TimerB channel
 *         This parameter can be one of the following values:
 *           @arg TIMERB_BUF_CH12:      TimerB channel 1
 *           @arg TIMERB_BUF_CH34:      TimerB channel 2
 *           @arg TIMERB_BUF_CH56:      TimerB channel 3
 * @retval None
 */
void TIMERB_EnableBuf(M4_TMRB_TypeDef *TMRBx, uint32_t u32Ch)
{
    __IO uint16_t *TMRB_BCONR;

    /* Check parameters */
    DDL_ASSERT(IS_TIMERB_BUF_CH(u32Ch));
    DDL_ASSERT(IS_TIMERB_INSTANCE(TMRBx));

    TMRB_BCONR = TMRB_BCONRx(TMRBx, u32Ch);
    SET_REG16_BIT(*TMRB_BCONR, TMRB_BCONR_BEN);
}

/**
 * @brief  Disable TimerB buffer function.
 * @param  [in] TMRBx                   Pointer to TimerB instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_TMRB:              TimerB unit 1 instance register base
 * @param  [in] u32Ch                   TimerB channel
 *         This parameter can be one of the following values:
 *           @arg TIMERB_BUF_CH12:      TimerB channel 1
 *           @arg TIMERB_BUF_CH34:      TimerB channel 2
 *           @arg TIMERB_BUF_CH56:      TimerB channel 3
 * @retval None
 */
void TIMERB_DisableBuf(M4_TMRB_TypeDef *TMRBx, uint32_t u32Ch)
{
    __IO uint16_t *TMRB_BCONR;

    /* Check parameters */
    DDL_ASSERT(IS_TIMERB_BUF_CH(u32Ch));
    DDL_ASSERT(IS_TIMERB_INSTANCE(TMRBx));

    TMRB_BCONR = TMRB_BCONRx(TMRBx, u32Ch);
    CLEAR_REG16_BIT(*TMRB_BCONR, TMRB_BCONR_BEN);
}

/**
 * @brief  Set TimerB triangle wave buffer mode.
 * @param  [in] TMRBx                   Pointer to TimerB instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_TMRB:              TimerB unit 1 instance register base
 * @param  [in] u32Ch                   TimerB channel
 *         This parameter can be one of the following values:
 *           @arg TIMERB_BUF_CH12:      TimerB channel 1
 *           @arg TIMERB_BUF_CH34:      TimerB channel 2
 *           @arg TIMERB_BUF_CH56:      TimerB channel 3
 * @param  [in] u16Mode                 TimerB channel
 *         This parameter can be one of the following values:
 *           @arg TIMERB_TRIANGLE_WAVE_BUF_PEAK:    Transfer buffer value when TimerB count peak
 *           @arg TIMERB_TRIANGLE_WAVE_BUF_ZERO:    Transfer buffer value when TimerB count zero
 * @retval None
 */
 void TIMERB_SetTriangleWaveBufMode(M4_TMRB_TypeDef *TMRBx,
                                    uint32_t u32Ch,
                                    uint16_t u16Mode)
{
    __IO uint16_t *TMRB_BCONR;

    /* Check parameters */
    DDL_ASSERT(IS_TIMERB_BUF_CH(u32Ch));
    DDL_ASSERT(IS_TIMERB_INSTANCE(TMRBx));

    TMRB_BCONR = TMRB_BCONRx(TMRBx, u32Ch);
    MODIFY_REG16(*TMRB_BCONR, (TMRB_BCONR_BSE0 | TMRB_BCONR_BSE1), u16Mode);
}

/**
 * @brief  Set TimerB compare register value.
 * @param  [in] TMRBx                   Pointer to TimerB instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_TMRB:              TimerB unit 1 instance register base
 * @param  [in] u32Ch                   TimerB channel
 *         This parameter can be one of the following values:
 *           @arg TIMERB_CH1:           TimerB channel 1
 *           @arg TIMERB_CH2:           TimerB channel 2
 *           @arg TIMERB_CH3:           TimerB channel 3
 *           @arg TIMERB_CH4:           TimerB channel 4
 *           @arg TIMERB_CH5:           TimerB channel 5
 *           @arg TIMERB_CH6:           TimerB channel 6
 * @param  [in] u16Value Compare value (between Min_Data=0 and Max_Data=0xFFFF)
 * @retval None
 */
void TIMERB_SetCompare(M4_TMRB_TypeDef *TMRBx,
                                uint32_t u32Ch,
                                uint16_t u16Value)
{
    __IO uint16_t *TMRB_CMPAR;

    /* Check parameters */
    DDL_ASSERT(IS_TIMERB_CH(u32Ch));
    DDL_ASSERT(IS_TIMERB_INSTANCE(TMRBx));

    TMRB_CMPAR = TMRB_CMPARx(TMRBx, u32Ch);
    WRITE_REG16(*TMRB_CMPAR, u16Value);
}

/**
 * @brief  Get TimerB compare register value.
 * @param  [in] TMRBx                   Pointer to TimerB instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_TMRB:              TimerB unit 1 instance register base
 * @param  [in] u32Ch                   TimerB channel
 *         This parameter can be one of the following values:
 *           @arg TIMERB_CH1:           TimerB channel 1
 *           @arg TIMERB_CH2:           TimerB channel 2
 *           @arg TIMERB_CH3:           TimerB channel 3
 *           @arg TIMERB_CH4:           TimerB channel 4
 *           @arg TIMERB_CH5:           TimerB channel 5
 *           @arg TIMERB_CH6:           TimerB channel 6
 * @retval Compare value (between Min_Data=0 and Max_Data=0xFFFF)
 */
uint16_t TIMERB_GetCompare(M4_TMRB_TypeDef *TMRBx, uint32_t u32Ch)
{
    __IO uint16_t *TMRB_CMPAR;

    /* Check parameters */
    DDL_ASSERT(IS_TIMERB_CH(u32Ch));
    DDL_ASSERT(IS_TIMERB_INSTANCE(TMRBx));

    TMRB_CMPAR = TMRB_CMPARx(TMRBx, u32Ch);
    return READ_REG16(*TMRB_CMPAR);
}

/**
 * @brief  Initialize TimerB input capture function.
 * @param  [in] TMRBx                   Pointer to TimerB instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_TMRB:              TimerB unit 1 instance register base
 * @param  [in] u32PwmCh                TimerB channel(Channel 5&6 don't support this function)
 *         This parameter can be one of the following values:
 *           @arg TIMERB_CH1:           TimerB channel 1
 *           @arg TIMERB_CH2:           TimerB channel 2
 *           @arg TIMERB_CH3:           TimerB channel 3
 *           @arg TIMERB_CH4:           TimerB channel 4
 * @param  [in] pstcIcInit              Pointer to a @ref stc_timerb_ic_init_t structure (TMRBx unit input capture function configuration data structure).
 * @retval An en_result_t enumeration value:
 *           - Ok: Initialize success
 *           - ErrorInvalidParameter: TMRBx is invalid instance or pstcIcInit == NULL
 */
en_result_t TIMERB_IC_Init(M4_TMRB_TypeDef *TMRBx,
                                uint32_t u32PwmCh,
                                const stc_timerb_ic_init_t *pstcIcInit)
{
    __IO uint16_t *TMRB_CCONR;
    en_result_t enRet = ErrorInvalidParameter;

    /* Check TMRBx instance and pstcIcInit */
    if (NULL != pstcIcInit)
    {
        /* Check parameters */
        DDL_ASSERT(IS_TIMERB_INSTANCE(TMRBx));
        DDL_ASSERT(IS_TIMERB_PWM_CH(u32PwmCh));
        DDL_ASSERT(IS_TIMERB_IC_CAPTURE_CONDITION(pstcIcInit->u16CaptureCondition));
        DDL_ASSERT(IS_TIMERB_IC_NOISE_FILTER_CLKDIV(pstcIcInit->u16NoiseFilterClkDiv));

