levizh/hc32m423/ddl/hc32m423_ddl/driver/src/hc32m423_timerb.c
        TMRB_CCONR = TMRB_CCONRx(TMRBx, u32PwmCh);

        MODIFY_REG16(*TMRB_CCONR,                                              \
                     (TMRB_CCONR_CAPMDA   | TMRB_CCONR_HICP |                  \
                      TMRB_CCONR_NOFIENCP | TMRB_CCONR_NOFICKCP),              \
                     (TIMERB_INPUT_CAPTURE            |                        \
                      pstcIcInit->u16CaptureCondition |                        \
                      pstcIcInit->u16NoiseFilterClkDiv));
        enRet = Ok;
    }

    return enRet;
}

/**
 * @brief  Set the fields of structure stc_timerb_ic_init_t to default values.
 * @param  [out] pstcIcInit             Pointer to a @ref stc_timerb_ic_init_t structure (TMRBx unit input capture function configuration data structure).
 * @retval None
 */
en_result_t TIMERB_IC_StructInit(stc_timerb_ic_init_t *pstcIcInit)
{
    en_result_t enRet = ErrorInvalidParameter;

    /* Check parameters */
    if (NULL != pstcIcInit)
    {
        pstcIcInit->u16NoiseFilterClkDiv = TIMERB_IC_NOFICLKDIV_NONE;
        pstcIcInit->u16CaptureCondition = TIMERB_IC_INVALID;
        enRet = Ok;
    }

    return enRet;
}

/**
 * @brief  De-Initialize TimerB unit input capture.
 * @param  [in] TMRBx                   Pointer to TimerB instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_TMRB:              TimerB unit 1 instance register base
 * @param  [in] u32PwmCh                TimerB channel(Channel 5&6 don't support this function)
 *         This parameter can be one of the following values:
 *           @arg TIMERB_CH1:           TimerB channel 1
 *           @arg TIMERB_CH2:           TimerB channel 2
 *           @arg TIMERB_CH3:           TimerB channel 3
 *           @arg TIMERB_CH4:           TimerB channel 4
 * @retval An en_result_t enumeration value:
 *           - Ok: De-Initialize success
 *           - ErrorInvalidParameter: TMRBx is invalid instance
 */
en_result_t TIMERB_IC_DeInit(M4_TMRB_TypeDef *TMRBx, uint32_t u32PwmCh)
{
    __IO uint16_t *TMRB_CCONR;
    en_result_t enRet = ErrorInvalidParameter;

    /* Check TMRBx instance */
    if (IS_TIMERB_INSTANCE(TMRBx))
    {
        /* Check parameters */
        DDL_ASSERT(IS_TIMERB_PWM_CH(u32PwmCh));

        TMRB_CCONR = TMRB_CCONRx(TMRBx, u32PwmCh);

        /* Configures the registers to reset value. */
        WRITE_REG16(TMRBx->PERAR, 0xFFFFU);
        WRITE_REG16(*TMRB_CCONR, 0x0001U);
        WRITE_REG16(TMRBx->HCONR, 0x0000U);
        WRITE_REG16(TMRBx->HCUPR, 0x0000U);
        WRITE_REG16(TMRBx->HCDOR, 0x0000U);
        enRet = Ok;
    }

    return enRet;
}

/**
 * @brief  Set TimerB input capture condition.
 * @param  [in] TMRBx                   Pointer to TimerB instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_TMRB:              TimerB unit 1 instance register base
 * @param  [in] u32PwmCh                TimerB channel(Channel 5&6 don't support this function)
 *         This parameter can be one of the following values:
 *           @arg TIMERB_CH1:           TimerB channel 1
 *           @arg TIMERB_CH2:           TimerB channel 2
 *           @arg TIMERB_CH3:           TimerB channel 3
 *           @arg TIMERB_CH4:           TimerB channel 4
 * @param  [in] u16Condition            TimerB input capture condition
 *         This parameter can be any composed value of the following values:
 *           @arg TIMERB_IC_RISING:     Capture triggered by rising edge on timer input TIMB_<t>_PWM1
 *           @arg TIMERB_IC_FALLING:    Capture triggered by falling edge on timer input TIMB_<t>_PWM1
 *           @arg TIMERB_IC_EVT:        Capture triggered by the timer TMRB_HTSSR specified event
 *           @arg TIMERB_IC_INVALID:    Don't occur capture action
 * @retval None
 */
void TIMERB_IC_SetCaptureCondition(M4_TMRB_TypeDef *TMRBx,
                                            uint32_t u32PwmCh,
                                            uint16_t u16Condition)
{
    __IO uint16_t *TMRB_CCONR;

    /* Check parameters */
    DDL_ASSERT(IS_TIMERB_INSTANCE(TMRBx));
    DDL_ASSERT(IS_TIMERB_PWM_CH(u32PwmCh));
    DDL_ASSERT(IS_TIMERB_IC_CAPTURE_CONDITION(u16Condition));

    TMRB_CCONR = TMRB_CCONRx(TMRBx, u32PwmCh);
    MODIFY_REG16(*TMRB_CCONR, TMRB_CCONR_HICP, u16Condition);
}

/**
 * @brief  Get TimerB input capture condition.
 * @param  [in] TMRBx                   Pointer to TimerB instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_TMRB:              TimerB unit 1 instance register base
 * @param  [in] u32PwmCh                TimerB channel(Channel 5&6 don't support this function)
 *         This parameter can be one of the following values:
 *           @arg TIMERB_CH1:           TimerB channel 1
 *           @arg TIMERB_CH2:           TimerB channel 2
 *           @arg TIMERB_CH3:           TimerB channel 3
 *           @arg TIMERB_CH4:           TimerB channel 4
 * @retval Returned value can be any composed value of the following values:
 *           @arg TIMERB_IC_RISING:     Capture triggered by rising edge on timer input TIMB_<t>_PWM1
 *           @arg TIMERB_IC_FALLING:    Capture triggered by falling edge on timer input TIMB_<t>_PWM1
 *           @arg TIMERB_IC_EVT:        Capture triggered by the timer TMRB_HTSSR specified event
 *           @arg TIMERB_IC_INVALID:    Don't occur capture action
 */
uint16_t TIMERB_IC_GetCaptureCondition(M4_TMRB_TypeDef *TMRBx,
                                            uint32_t u32PwmCh)
{
    __IO uint16_t *TMRB_CCONR;

    /* Check parameters */
    DDL_ASSERT(IS_TIMERB_INSTANCE(TMRBx));
    DDL_ASSERT(IS_TIMERB_PWM_CH(u32PwmCh));

    TMRB_CCONR = TMRB_CCONRx(TMRBx, u32PwmCh);
    return READ_REG16_BIT(*TMRB_CCONR, TMRB_CCONR_HICP);
}

/**
 * @brief  Set TimerB input capture noise filter clock division.
 * @param  [in] TMRBx                   Pointer to TimerB instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_TMRB:              TimerB unit 1 instance register base
 * @param  [in] u32PwmCh                TimerB channel(Channel 5&6 don't support this function)
 *         This parameter can be one of the following values:
 *           @arg TIMERB_CH1:           TimerB channel 1
 *           @arg TIMERB_CH2:           TimerB channel 2
 *           @arg TIMERB_CH3:           TimerB channel 3
 *           @arg TIMERB_CH4:           TimerB channel 4
 * @param  [in] u16Div                  TimerB input capture noise filter clock division
 *         This parameter can be one of the following values:
 *           @arg TIMERB_IC_NOFICLKDIV_NONE:    Disable filter
 *           @arg TIMERB_IC_NOFICLKDIV_DIV1:    HCLK
 *           @arg TIMERB_IC_NOFICLKDIV_DIV4:    HCLK/4
 *           @arg TIMERB_IC_NOFICLKDIV_DIV16:   HCLK/16
 *           @arg TIMERB_IC_NOFICLKDIV_DIV64:   HCLK/64
 * @retval None
 */
void TIMERB_IC_SetFilterClkDiv(M4_TMRB_TypeDef *TMRBx, 
                                            uint32_t u32PwmCh,
                                            uint16_t u16Div)
{
    __IO uint16_t *TMRB_CCONR;

    /* Check parameters */
    DDL_ASSERT(IS_TIMERB_INSTANCE(TMRBx));
    DDL_ASSERT(IS_TIMERB_PWM_CH(u32PwmCh));
    DDL_ASSERT(IS_TIMERB_IC_NOISE_FILTER_CLKDIV(u16Div));

