levizh/hc32m423/ddl/hc32m423_ddl/driver/src/hc32m423_timerb.c
    TMRB_CCONR = TMRB_CCONRx(TMRBx, u32PwmCh);
    MODIFY_REG16(*TMRB_CCONR, (TMRB_CCONR_NOFIENCP | TMRB_CCONR_NOFICKCP), u16Div);
}

/**
 * @brief  Get TimerB input capture noise filter clock division.
 * @param  [in] TMRBx                   Pointer to TimerB instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_TMRB:              TimerB unit 1 instance register base
 * @param  [in] u32PwmCh                TimerB channel(Channel 5&6 don't support this function)
 *         This parameter can be one of the following values:
 *           @arg TIMERB_CH1:           TimerB channel 1
 *           @arg TIMERB_CH2:           TimerB channel 2
 *           @arg TIMERB_CH3:           TimerB channel 3
 *           @arg TIMERB_CH4:           TimerB channel 4
 * @retval Returned value can be one of the following values:
 *           @arg TIMERB_IC_NOFICLKDIV_NONE:    Disable filter
 *           @arg TIMERB_IC_NOFICLKDIV_DIV1:    HCLK
 *           @arg TIMERB_IC_NOFICLKDIV_DIV4:    HCLK/4
 *           @arg TIMERB_IC_NOFICLKDIV_DIV16:   HCLK/16
 *           @arg TIMERB_IC_NOFICLKDIV_DIV64:   HCLK/64
 */
uint16_t TIMERB_IC_GetFilterClkDiv(M4_TMRB_TypeDef *TMRBx,
                                                uint32_t u32PwmCh)
{
    __IO uint16_t *TMRB_CCONR;

    /* Check parameters */
    DDL_ASSERT(IS_TIMERB_INSTANCE(TMRBx));
    DDL_ASSERT(IS_TIMERB_PWM_CH(u32PwmCh));

    TMRB_CCONR = TMRB_CCONRx(TMRBx, u32PwmCh);
    return READ_REG16_BIT(*TMRB_CCONR, (TMRB_CCONR_NOFIENCP | TMRB_CCONR_NOFICKCP));
}

/**
 * @brief  Enable TimerB input capture noise filter function.
 * @param  [in] TMRBx                   Pointer to TimerB instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_TMRB:              TimerB unit 1 instance register base
 * @param  [in] u32PwmCh                TimerB channel(Channel 5&6 don't support this function)
 *         This parameter can be one of the following values:
 *           @arg TIMERB_CH1:           TimerB channel 1
 *           @arg TIMERB_CH2:           TimerB channel 2
 *           @arg TIMERB_CH3:           TimerB channel 3
 *           @arg TIMERB_CH4:           TimerB channel 4
 * @retval None
 */
void TIMERB_IC_EnableNoiseFilter(M4_TMRB_TypeDef *TMRBx,
                                                uint32_t u32PwmCh)
{
    __IO uint16_t *TMRB_CCONR;

    /* Check parameters */
    DDL_ASSERT(IS_TIMERB_INSTANCE(TMRBx));
    DDL_ASSERT(IS_TIMERB_PWM_CH(u32PwmCh));

    TMRB_CCONR = TMRB_CCONRx(TMRBx, u32PwmCh);
    SET_REG16_BIT(*TMRB_CCONR, TMRB_CCONR_NOFIENCP);
}

/**
 * @brief  Disable TimerB input capture noise filter function.
 * @param  [in] TMRBx                   Pointer to TimerB instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_TMRB:              TimerB unit 1 instance register base
 * @param  [in] u32PwmCh                TimerB channel(Channel 5&6 don't support this function)
 *         This parameter can be one of the following values:
 *           @arg TIMERB_CH1:           TimerB channel 1
 *           @arg TIMERB_CH2:           TimerB channel 2
 *           @arg TIMERB_CH3:           TimerB channel 3
 *           @arg TIMERB_CH4:           TimerB channel 4
 * @retval None
 */
void TIMERB_IC_DisableNoiseFilter(M4_TMRB_TypeDef *TMRBx,
                                                uint32_t u32PwmCh)
{
    __IO uint16_t *TMRB_CCONR;

    /* Check parameters */
    DDL_ASSERT(IS_TIMERB_INSTANCE(TMRBx));
    DDL_ASSERT(IS_TIMERB_PWM_CH(u32PwmCh));

    TMRB_CCONR = TMRB_CCONRx(TMRBx, u32PwmCh);
    CLEAR_REG16_BIT(*TMRB_CCONR, TMRB_CCONR_NOFIENCP);
}

/**
 * @brief  Initialize TimerB output compare function.
 * @param  [in] TMRBx                   Pointer to TimerB instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_TMRB:              TimerB unit 1 instance register base
 * @param  [in] u32PwmCh                TimerB channel(Channel 5&6 don't support this function)
 *         This parameter can be one of the following values:
 *           @arg TIMERB_CH1:           TimerB channel 1
 *           @arg TIMERB_CH2:           TimerB channel 2
 *           @arg TIMERB_CH3:           TimerB channel 3
 *           @arg TIMERB_CH4:           TimerB channel 4
 * @param  [in] pstcOcInit              Pointer to a @ref stc_timerb_oc_init_t structure (TMRBx unit output compare function configuration data structure).
 * @retval An en_result_t enumeration value:
 *           - Ok: Initialize success
 *           - ErrorInvalidParameter: TMRBx is invalid instance or pstcOcInit == NULL
 */
en_result_t TIMERB_OC_Init(M4_TMRB_TypeDef *TMRBx,
                                uint32_t u32PwmCh,
                                const stc_timerb_oc_init_t *pstcOcInit)
{
    __IO uint16_t *TMRB_PCONR;
    __IO uint16_t *TMRB_CMPAR;
    en_result_t enRet = ErrorInvalidParameter;

    /* Check TMRBx instance and pstcOcInit */
    if (NULL != pstcOcInit)
    {
        /* Check parameters */
        DDL_ASSERT(IS_TIMERB_INSTANCE(TMRBx));
        DDL_ASSERT(IS_TIMERB_PWM_CH(u32PwmCh));
        DDL_ASSERT(IS_TIMERB_OC_PORT_OUTPUT_STATE(pstcOcInit->u16PortOutputState));
        DDL_ASSERT(IS_TIMERB_OC_START_CNT_OUTPUT_POLARITY(pstcOcInit->u16StartCntOutput));
        DDL_ASSERT(IS_TIMERB_OC_STOP_CNT_OUTPUT_POLARITY(pstcOcInit->u16StopCntOutput));
        DDL_ASSERT(IS_TIMERB_OC_CMPMATCH_OUTPUT_POLARITY(pstcOcInit->u16CompareMatchOutput));
        DDL_ASSERT(IS_TIMERB_OC_PERIODMATCH_OUTPUT_POLARITY(pstcOcInit->u16PeriodMatchOutput));

        TMRB_PCONR = TMRB_PCONRx(TMRBx, u32PwmCh);
        TMRB_CMPAR = TMRB_CMPARx(TMRBx, u32PwmCh);

        WRITE_REG16(*TMRB_CMPAR, pstcOcInit->u16CompareVal);
        WRITE_REG16(*TMRB_PCONR,                                               \
                    (pstcOcInit->u16StartCntOutput     |                       \
                     pstcOcInit->u16StopCntOutput      |                       \
                     pstcOcInit->u16CompareMatchOutput |                       \
                     pstcOcInit->u16PeriodMatchOutput  |                       \
                     pstcOcInit->u16PortOutputState));
        enRet = Ok;
    }

    return enRet;
}

/**
 * @brief  Set the fields of structure stc_timerb_oc_init_t to default values.
 * @param  [out] pstcOcInit             Pointer to a @ref stc_timerb_oc_init_t structure (TMRBx unit output compare function configuration data structure).
 * @retval None
 */
en_result_t TIMERB_OC_StructInit(stc_timerb_oc_init_t *pstcOcInit)
{
    en_result_t enRet = ErrorInvalidParameter;

    /* Check parameters */
    if (NULL != pstcOcInit)
    {
        pstcOcInit->u16CompareVal = 0xFFFFU;
        pstcOcInit->u16PortOutputState = TIMERB_OC_PORT_OUTPUT_DISABLE;
        pstcOcInit->u16StartCntOutput = TIMERB_OC_STARTCNT_OUTPUT_LOW;
        pstcOcInit->u16StopCntOutput = TIMERB_OC_STOPCNT_OUTPUT_LOW;
        pstcOcInit->u16CompareMatchOutput = TIMERB_OC_CMPMATCH_OUTPUT_LOW;
        pstcOcInit->u16PeriodMatchOutput = TIMERB_OC_PERIODMATCH_OUTPUT_LOW;
        enRet = Ok;
    }

    return enRet;
}

/**
 * @brief  De-Initialize TimerB unit output compare.
 * @param  [in] TMRBx                   Pointer to TimerB instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_TMRB:              TimerB unit 1 instance register base
 * @param  [in] u32PwmCh                TimerB channel(Channel 5&6 don't support this function)
 *         This parameter can be one of the following values:
 *           @arg TIMERB_CH1:           TimerB channel 1
 *           @arg TIMERB_CH2:           TimerB channel 2
 *           @arg TIMERB_CH3:           TimerB channel 3
 *           @arg TIMERB_CH4:           TimerB channel 4
 * @retval An en_result_t enumeration value:
 *           - Ok: De-Initialize success
 *           - ErrorInvalidParameter: TMRBx is invalid instance
 */
en_result_t TIMERB_OC_DeInit(M4_TMRB_TypeDef *TMRBx, uint32_t u32PwmCh)
{
    __IO uint16_t *TMRB_PCONR;
    __IO uint16_t *TMRB_CMPAR;
    en_result_t enRet = ErrorInvalidParameter;

    /* Check TMRBx instance */
    if (IS_TIMERB_INSTANCE(TMRBx))
    {
        TMRB_PCONR = TMRB_PCONRx(TMRBx, u32PwmCh);
        TMRB_CMPAR = TMRB_CMPARx(TMRBx, u32PwmCh);

