levizh/hc32m423/ddl/hc32m423_ddl/driver/src/hc32m423_timerb.c
        /* Configures the registers to reset value. */
        WRITE_REG16(*TMRB_PCONR, 0x0000U);
        WRITE_REG16(TMRBx->PERAR, 0xFFFFu);
        WRITE_REG16(*TMRB_CMPAR, 0xFFFFu);
        WRITE_REG16(TMRBx->BCSTR, 0x0000U);
        enRet = Ok;
    }

    return enRet;
}

/**
 * @brief  Enable TimerB output compare port output function.
 * @param  [in] TMRBx                   Pointer to TimerB instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_TMRB:              TimerB unit 1 instance register base
 * @param  [in] u32PwmCh                TimerB channel(Channel 5&6 don't support this function)
 *         This parameter can be one of the following values:
 *           @arg TIMERB_CH1:           TimerB channel 1
 *           @arg TIMERB_CH2:           TimerB channel 2
 *           @arg TIMERB_CH3:           TimerB channel 3
 *           @arg TIMERB_CH4:           TimerB channel 4
 * @retval None
 */
void TIMERB_OC_EnablePortOutput(M4_TMRB_TypeDef *TMRBx,
                                                    uint32_t u32PwmCh)
{
    __IO uint16_t *TMRB_PCONR;

    /* Check parameters */
    DDL_ASSERT(IS_TIMERB_INSTANCE(TMRBx));
    DDL_ASSERT(IS_TIMERB_PWM_CH(u32PwmCh));

    TMRB_PCONR = TMRB_PCONRx(TMRBx, u32PwmCh);
    SET_REG16_BIT(*TMRB_PCONR, TMRB_PCONR_OUTEN);
}

/**
 * @brief  Disable TimerB output compare port output function.
 * @param  [in] TMRBx                   Pointer to TimerB instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_TMRB:              TimerB unit 1 instance register base
 * @param  [in] u32PwmCh                TimerB channel(Channel 5&6 don't support this function)
 *         This parameter can be one of the following values:
 *           @arg TIMERB_CH1:           TimerB channel 1
 *           @arg TIMERB_CH2:           TimerB channel 2
 *           @arg TIMERB_CH3:           TimerB channel 3
 *           @arg TIMERB_CH4:           TimerB channel 4
 * @retval None
 */
void TIMERB_OC_DisablePortOutput(M4_TMRB_TypeDef *TMRBx,
                                                    uint32_t u32PwmCh)
{
    __IO uint16_t *TMRB_PCONR;

    /* Check parameters */
    DDL_ASSERT(IS_TIMERB_INSTANCE(TMRBx));
    DDL_ASSERT(IS_TIMERB_PWM_CH(u32PwmCh));

    TMRB_PCONR = TMRB_PCONRx(TMRBx, u32PwmCh);
    CLEAR_REG16_BIT(*TMRB_PCONR, TMRB_PCONR_OUTEN);
}

/**
 * @brief  Set TIMB_<t>_PWMn(t=1,n=1~4) port output polarity when start count.
 * @param  [in] TMRBx                   Pointer to TimerB instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_TMRB:              TimerB unit 1 instance register base
 * @param  [in] u32PwmCh                TimerB channel(Channel 5&6 don't support this function)
 *         This parameter can be one of the following values:
 *           @arg TIMERB_CH1:           TimerB channel 1
 *           @arg TIMERB_CH2:           TimerB channel 2
 *           @arg TIMERB_CH3:           TimerB channel 3
 *           @arg TIMERB_CH4:           TimerB channel 4
 * @param  [in] u16Polarity             TimerB TIMB_<t>_PWM1 port output polarity
 *         This parameter can be one of the following values:
 *           @arg TIMERB_OC_STARTCNT_OUTPUT_LOW     TIM_<t>_PWMn(t=1,n=1~4) output low level when TimerB start count
 *           @arg TIMERB_OC_STARTCNT_OUTPUT_HIGH    TIM_<t>_PWMn(t=1,n=1~4) output high level when TimerB start count
 *           @arg TIMERB_OC_STARTCNT_OUTPUT_HOLD    TIM_<t>_PWMn(t=1,n=1~4) output hold level when TimerB start count
 * @retval None
 */
void TIMERB_OC_SetStartCntOutputPolarity(M4_TMRB_TypeDef *TMRBx,
                                                    uint32_t u32PwmCh,
                                                    uint16_t u16Polarity)
{
    __IO uint16_t *TMRB_PCONR;

    /* Check parameters */
    DDL_ASSERT(IS_TIMERB_INSTANCE(TMRBx));
    DDL_ASSERT(IS_TIMERB_PWM_CH(u32PwmCh));
    DDL_ASSERT(IS_TIMERB_OC_START_CNT_OUTPUT_POLARITY(u16Polarity));

    TMRB_PCONR = TMRB_PCONRx(TMRBx, u32PwmCh);
    MODIFY_REG16(*TMRB_PCONR, TMRB_PCONR_STAC, u16Polarity);
}

/**
 * @brief  Get TIMB_<t>_PWMn(t=1,n=1~4) port output polarity for start count.
 * @param  [in] TMRBx                   Pointer to TimerB instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_TMRB:              TimerB unit 1 instance register base
 * @param  [in] u32PwmCh                TimerB channel(Channel 5&6 don't support this function)
 *         This parameter can be one of the following values:
 *           @arg TIMERB_CH1:           TimerB channel 1
 *           @arg TIMERB_CH2:           TimerB channel 2
 *           @arg TIMERB_CH3:           TimerB channel 3
 *           @arg TIMERB_CH4:           TimerB channel 4
 * @retval Returned value can be one of the following values:
 *           @arg TIMERB_OC_STARTCNT_OUTPUT_LOW     TIM_<t>_PWMn(t=1,n=1~4) output low level when TimerB start count
 *           @arg TIMERB_OC_STARTCNT_OUTPUT_HIGH    TIM_<t>_PWMn(t=1,n=1~4) output high level when TimerB start count
 *           @arg TIMERB_OC_STARTCNT_OUTPUT_HOLD    TIM_<t>_PWMn(t=1,n=1~4) output hold level when TimerB start count
 */
uint16_t TIMERB_OC_GetStartCntOutputPolarity(M4_TMRB_TypeDef *TMRBx,
                                                    uint32_t u32PwmCh)
{
    __IO uint16_t *TMRB_PCONR;

    /* Check parameters */
    DDL_ASSERT(IS_TIMERB_INSTANCE(TMRBx));
    DDL_ASSERT(IS_TIMERB_PWM_CH(u32PwmCh));

    TMRB_PCONR = TMRB_PCONRx(TMRBx, u32PwmCh);
    return READ_REG16_BIT(*TMRB_PCONR, TMRB_PCONR_STAC);
}

/**
 * @brief  Set TIMB_<t>_PWMn(t=1,n=1~4) port output polarity for stop count.
 * @param  [in] TMRBx                   Pointer to TimerB instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_TMRB:              TimerB unit 1 instance register base
 * @param  [in] u32PwmCh                TimerB channel(Channel 5&6 don't support this function)
 *         This parameter can be one of the following values:
 *           @arg TIMERB_CH1:           TimerB channel 1
 *           @arg TIMERB_CH2:           TimerB channel 2
 *           @arg TIMERB_CH3:           TimerB channel 3
 *           @arg TIMERB_CH4:           TimerB channel 4
 * @param  [in] u16Polarity             TimerB TIMB_<t>_PWM1 port output polarity
 *         This parameter can be one of the following values:
 *           @arg TIMERB_OC_STOPCNT_OUTPUT_LOW      TIM_<t>_PWMn(t=1,n=1~4) output low level when TimerB stop count
 *           @arg TIMERB_OC_STOPCNT_OUTPUT_HIGH     TIM_<t>_PWMn(t=1,n=1~4) output high level when TimerB stop count
 *           @arg TIMERB_OC_STOPCNT_OUTPUT_HOLD     TIM_<t>_PWMn(t=1,n=1~4) output hold level when TimerB stop count
 * @retval None
 */
void TIMERB_OC_SetStopCntOutputPolarity(M4_TMRB_TypeDef *TMRBx,
                                                    uint32_t u32PwmCh,
                                                    uint16_t u16Polarity)
{
    __IO uint16_t *TMRB_PCONR;

    /* Check parameters */
    DDL_ASSERT(IS_TIMERB_INSTANCE(TMRBx));
    DDL_ASSERT(IS_TIMERB_PWM_CH(u32PwmCh));
    DDL_ASSERT(IS_TIMERB_OC_STOP_CNT_OUTPUT_POLARITY(u16Polarity));

