levizh/hc32m423/ddl/hc32m423_ddl/driver/src/hc32m423_timerb.c
    TMRB_PCONR = TMRB_PCONRx(TMRBx, u32PwmCh);
    MODIFY_REG16(*TMRB_PCONR, TMRB_PCONR_STPC, u16Polarity);
}

/**
 * @brief  Get TIMB_<t>_PWMn(t=1,n=1~4) port output polarity for stop count.
 * @param  [in] TMRBx                   Pointer to TimerB instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_TMRB:              TimerB unit 1 instance register base
 * @param  [in] u32PwmCh                TimerB channel(Channel 5&6 don't support this function)
 *         This parameter can be one of the following values:
 *           @arg TIMERB_CH1:           TimerB channel 1
 *           @arg TIMERB_CH2:           TimerB channel 2
 *           @arg TIMERB_CH3:           TimerB channel 3
 *           @arg TIMERB_CH4:           TimerB channel 4
 * @retval Returned value can be one of the following values:
 *           @arg TIMERB_OC_STOPCNT_OUTPUT_LOW      TIM_<t>_PWMn(t=1,n=1~4) output low level when TimerB stop count
 *           @arg TIMERB_OC_STOPCNT_OUTPUT_HIGH     TIM_<t>_PWMn(t=1,n=1~4)1 output high level when TimerB stop count
 *           @arg TIMERB_OC_STOPCNT_OUTPUT_HOLD     TIM_<t>_PWMn(t=1,n=1~4) output hold level when TimerB stop count
 */
uint16_t TIMERB_OC_GetStopCntOutputPolarity(M4_TMRB_TypeDef *TMRBx,
                                                    uint32_t u32PwmCh)
{
    __IO uint16_t *TMRB_PCONR;

    /* Check parameters */
    DDL_ASSERT(IS_TIMERB_INSTANCE(TMRBx));
    DDL_ASSERT(IS_TIMERB_PWM_CH(u32PwmCh));

    TMRB_PCONR = TMRB_PCONRx(TMRBx, u32PwmCh);
    return READ_REG16_BIT(*TMRB_PCONR, TMRB_PCONR_STPC);
}

/**
 * @brief  Set TIMB_<t>_PWMn(t=1,n=1~4) port output polarity for compare match.
 * @param  [in] TMRBx                   Pointer to TimerB instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_TMRB:              TimerB unit 1 instance register base
 * @param  [in] u32PwmCh                TimerB channel(Channel 5&6 don't support this function)
 *         This parameter can be one of the following values:
 *           @arg TIMERB_CH1:           TimerB channel 1
 *           @arg TIMERB_CH2:           TimerB channel 2
 *           @arg TIMERB_CH3:           TimerB channel 3
 *           @arg TIMERB_CH4:           TimerB channel 4
 * @param  [in] u16Polarity             TimerB TIMB_<t>_PWM1 port output polarity
 *         This parameter can be one of the following values:
 *           @arg TIMERB_OC_CMPMATCH_OUTPUT_LOW         TIM_<t>_PWMn(t=1,n=1~4) output low level when TimerB comapre match
 *           @arg TIMERB_OC_CMPMATCH_OUTPUT_HIGH        TIM_<t>_PWMn(t=1,n=1~4) output high level when TimerB comapre match
 *           @arg TIMERB_OC_CMPMATCH_OUTPUT_HOLD        TIM_<t>_PWMn(t=1,n=1~4) output hold level when TimerB comapre match
 *           @arg TIMERB_OC_CMPMATCH_OUTPUT_INVERTED    TIM_<t>_PWMn(t=1,n=1~4) output inverted level when TimerB comapre match
 * @retval None
 */
void TIMERB_OC_SetCmpMatchOutputPolarity(M4_TMRB_TypeDef *TMRBx,
                                                    uint32_t u32PwmCh,
                                                    uint16_t u16Polarity)
{
    __IO uint16_t *TMRB_PCONR;

    /* Check parameters */
    DDL_ASSERT(IS_TIMERB_INSTANCE(TMRBx));
    DDL_ASSERT(IS_TIMERB_PWM_CH(u32PwmCh));
    DDL_ASSERT(IS_TIMERB_OC_CMPMATCH_OUTPUT_POLARITY(u16Polarity));

    TMRB_PCONR = TMRB_PCONRx(TMRBx, u32PwmCh);
    MODIFY_REG16(*TMRB_PCONR, TMRB_PCONR_CMPC, u16Polarity);
}

/**
 * @brief  Get TIMB_<t>_PWM1 port output polarity for compare match.
 * @param  [in] TMRBx                   Pointer to TimerB instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_TMRB:              TimerB unit 1 instance register base
 * @param  [in] u32PwmCh                TimerB channel(Channel 5&6 don't support this function)
 *         This parameter can be one of the following values:
 *           @arg TIMERB_CH1:           TimerB channel 1
 *           @arg TIMERB_CH2:           TimerB channel 2
 *           @arg TIMERB_CH3:           TimerB channel 3
 *           @arg TIMERB_CH4:           TimerB channel 4
 * @retval Returned value can be one of the following values:
 *           @arg TIMERB_OC_CMPMATCH_OUTPUT_LOW         TIM_<t>_PWMn(t=1,n=1~4) output low level when TimerB comapre match
 *           @arg TIMERB_OC_CMPMATCH_OUTPUT_HIGH        TIM_<t>_PWMn(t=1,n=1~4) output high level when TimerB comapre match
 *           @arg TIMERB_OC_CMPMATCH_OUTPUT_HOLD        TIM_<t>_PWMn(t=1,n=1~4) output hold level when TimerB comapre match
 *           @arg TIMERB_OC_CMPMATCH_OUTPUT_INVERTED    TIM_<t>_PWMn(t=1,n=1~4) output inverted level when TimerB comapre match
 */
uint16_t TIMERB_OC_GetCmpMatchOutputPolarity(M4_TMRB_TypeDef *TMRBx,
                                                    uint32_t u32PwmCh)
{
    __IO uint16_t *TMRB_PCONR;

    /* Check parameters */
    DDL_ASSERT(IS_TIMERB_INSTANCE(TMRBx));
    DDL_ASSERT(IS_TIMERB_PWM_CH(u32PwmCh));

    TMRB_PCONR = TMRB_PCONRx(TMRBx, u32PwmCh);
    return READ_REG16_BIT(*TMRB_PCONR, TMRB_PCONR_CMPC);
}

/**
 * @brief  Set TIMB_<t>_PWMn(t=1,n=1~4) port output polarity for period match.
 * @param  [in] TMRBx                   Pointer to TimerB instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_TMRB:              TimerB unit 1 instance register base
 * @param  [in] u32PwmCh                TimerB channel(Channel 5&6 don't support this function)
 *         This parameter can be one of the following values:
 *           @arg TIMERB_CH1:           TimerB channel 1
 *           @arg TIMERB_CH2:           TimerB channel 2
 *           @arg TIMERB_CH3:           TimerB channel 3
 *           @arg TIMERB_CH4:           TimerB channel 4
 * @param  [in] u16Polarity             TimerB TIMB_<t>_PWM1 port output polarity
 *         This parameter can be one of the following values:
 *           @arg TIMERB_OC_PERIODMATCH_OUTPUT_LOW          TIM_<t>_PWMn(t=1,n=1~4) output low level when TimerB period match
 *           @arg TIMERB_OC_PERIODMATCH_OUTPUT_HIGH         TIM_<t>_PWMn(t=1,n=1~4) output high level when TimerB period match
 *           @arg TIMERB_OC_PERIODMATCH_OUTPUT_HOLD         TIM_<t>_PWMn(t=1,n=1~4) output hold level when TimerB period match
 *           @arg TIMERB_OC_PERIODMATCH_OUTPUT_INVERTED     TIM_<t>_PWMn(t=1,n=1~4) output inverted level when TimerB period match
 * @retval None
 */
void TIMERB_OC_SetPeriodMatchOutputPolarity(M4_TMRB_TypeDef *TMRBx,
                                                        uint32_t u32PwmCh,
                                                        uint16_t u16Polarity)
{
    __IO uint16_t *TMRB_PCONR;

    /* Check parameters */
    DDL_ASSERT(IS_TIMERB_INSTANCE(TMRBx));
    DDL_ASSERT(IS_TIMERB_PWM_CH(u32PwmCh));
    DDL_ASSERT(IS_TIMERB_OC_PERIODMATCH_OUTPUT_POLARITY(u16Polarity));

